#include <stdio.h>
#include <stdlib.h>

int main(void)
{
/*
    *十进制转二进制，除2反向取余法
    *二进制转十进制
    二进制数从左到右为高位到低位，最低位代表2^0,高一位为2^1，以此类推（2^10 = 1024）
    如101101转换为十进制：1*2^0+0*2^1+1*2^2+1*2^3+0*2^4+1*2^5 = 1+0+4+8+0+32 = 45



    定义八进制数语法：0开头，每位数0~7之间，如056
    *十进制转八进制，除8反向取余法
    八进制数从左到右为高位到低位，最低位代表8^0,高一位为8^1，以此类推
    *八进制转十进制
    如056转换为十进制：6*8^0+5*8^1 = 6+40 = 46
    *八进制转二进制，按421码将每个八进制位展开
                      4 2 1
    如056转二进制：5 = 1 0 1 (5=4+1)
                  6 = 1 1 0 (6=4+2)
                  056 = 101110
    *二进制转八进制
    将二进制数从右往左三个数分为一组,最后不足三位的在前方用0补齐，再按照421码将每组数合并
    如10110101转八进制：10110101=>010 110 101
                                  2   6   5
                       10110101 = 0265
    


    定义十六进制数语法：以0x开头，每位数0~9/A~F(a~f)之间，如0x1A
    *十进制转十六进制，除16反向取余法
    十六进制数从左到右为高位到低位，最低位代表16^0,高一位为16^1，以此类推
    *十六进制转十进制
    如0x1A转十进制：10+16 = 26
    *十六进制转二进制，按8421码将每个十六进制位展开
                       8 4 2 1
    如0x1A转二进制：1 = 0 0 0 1
                   A = 1 0 1 0
                   0x1A = 11010
    *二进制转十六进制
    将二进制数从右往左四个数分为一组,最后不足四位的在前方用0补齐，再按照8421码将每组数合并
    如1001101011转十六进制：1001101011=>0010 0110 1011
                                        2    6    B
                           1001101011 = 0x26B
*/

    int a = 0x26B;//十六进制，格式匹配符为%x
    int b = 056;//八进制，格式匹配符为%o
    int c = 132;//十进制，格式匹配符为%d
    int d = 010110101;//不允许给变量直接赋值二进制数

    printf("十六进制显示 a = %x\n",a);
    printf("十进制显示 a = %d\n",a);
    printf("八进制显示 a = %o\n",a);

    system ("pause");
    return 0;
}